src_ext/InformationRegisters/УЗ_ЦеныТарифов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>УЗ_ЦеныТарифов</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоЧасов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>13</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоУроков</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Тариф</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Тарифы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src_ext/InformationRegisters/УЗ_ЦеныТарифов/Forms/ФормаЗаписиТолькоЧтение/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	Оповестить("ЗакрытьФорму");
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Запись.Тариф = Параметры.Тариф;
	ЧасыТекстом = УЗ_ОбщийКлиентСервер.ЧасыМинуты(Запись.КоличествоЧасов, Истина);
КонецПроцедуры

//Часы вводятся строкой «ч:мм» (реквизит формы ЧасыТекстом), хранятся числом часов.
&НаКлиенте
Процедура КоличествоЧасовПриИзменении(Элемент)
	Часы = УЗ_ОбщийКлиентСервер.ЧасыИзСтроки(ЧасыТекстом);
	Если Часы = Неопределено Тогда
		УЗ_ОбщийКлиентСервер.СообщитьПользователю(НСтр("ru = 'Часы вводятся как ч:мм, например 1:30.'"), "ЧасыТекстом");
	Иначе
		Запись.КоличествоЧасов = Часы;
		Запись.КоличествоУроков = 0;
	КонецЕсли;
	ЧасыТекстом = УЗ_ОбщийКлиентСервер.ЧасыМинуты(Запись.КоличествоЧасов, Истина);
	ОбновитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура КоличествоЗанятийПриИзменении(Элемент)
	Запись.КоличествоЧасов = 0;
	ЧасыТекстом = "";
	ОбновитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВидимость()

	Если Запись.КоличествоУроков > 0 Тогда
		Элементы.Декорация1.Заголовок = "" +Формат(Запись.Сумма/Запись.КоличествоУроков,"ЧДЦ=2")+ " за 1 урок ("
		+Формат(Запись.Сумма,"ЧДЦ=2")+ " / " +Запись.КоличествоУроков+ " ур.)";
	ИначеЕсли Запись.КоличествоЧасов > 0 Тогда
		Элементы.Декорация1.Заголовок = "" +Формат(Запись.Сумма/Запись.КоличествоЧасов,"ЧДЦ=2")+ " за 1 час ("
		+Формат(Запись.Сумма,"ЧДЦ=2")+ " / " + УЗ_ОбщийКлиентСервер.ЧасыМинуты(Запись.КоличествоЧасов) + " ч.)";
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура СуммаПриИзменении(Элемент)
	ОбновитьВидимость();
КонецПроцедуры
